Public Attributes | List of all members
API_Gable Struct Reference
Element Manager
Defines a cutting plane applied to spatial elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | a
Plane coefficients relative to the parent element.
 double  | b
Plane coefficients relative to the parent element.
 double  | c
Plane coefficients relative to the parent element.
 double  | d
Plane coefficients relative to the parent element.
 double  | xb
Beginning distance of vertical cut planes from local origin.
 double  | xe
End distance of vertical cut planes from local origin.
 double  | nx
X component of the normal vector of vertical cut planes (nz always 0.0).
 double  | ny
Y component of the normal vector of vertical cut planes (nz always 0.0).
 short  | cutElem
Element the gable is generated from (output only).
 API_AttributeIndex  | material
Material for the cut surface (output only).
 API_Coord **  | coords
Coordinate array, only if cut is limited to a polygon.
 Int32 **  | pends
Polygon endpoints; see API_Polygon for more information.
 API_PolyArc **  | parcs
Polygon arcs; see API_PolyArc and API_Polygon for more information.
Detailed Description
Defines a cutting plane applied to spatial elements.
Remarks
The a, b, c, d plane coefficients are the parameters of the plane equation: *a** x + b y + c z = d Where x, y and z are points in 3D space, a, b and c are the x, y and z components of the surface normal, and d is the distance value. A point whose components are put into x, y and z is on the plane if the above equality is satisfied. All gable data is defined in the local coordinate system of the element. The picture below shows how gable parameters should be interpreted for curved walls:
 Wall gable
 Note that the coordinates of the limit polygon are transformed (shifted and rotated) into a position relative to the first edge of the zone polygon. To get the real gable polygon coordinates you should transform them back. Check the Dump Zone function in the Element_Manager example project.